Table of Contents
 Class GrpcBimHostingFactory
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class GrpcBimHostingFactory : IBimHostingFactory
Inheritance
object
GrpcBimHostingFactory
Implements
IBimHostingFactory
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 Create(IBIMPluginFactory, IPluginLogger)
public IBIMPluginHosting Create(IBIMPluginFactory pluginFactory, IPluginLogger logger)
Parameters
pluginFactory IBIMPluginFactory
logger IPluginLogger
Returns
IBIMPluginHosting
 InitGrpcClient(IPluginLogger)
public IProgressMessaging InitGrpcClient(IPluginLogger logger)
Parameters
logger IPluginLogger
Returns
IProgressMessaging
 Edit this page